mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xr/mb9bf36xr.svd
        <!-- REGISTER "FBFCR" -->
        <register>
          <name>FBFCR</name>
          <description>Flash Buffer Control Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BS" -->
            <field>
              <name>BS</name>
              <description>Buffer Status</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Buffer Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description>Flash Interrupt Control Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIE" -->
            <field>
              <name>ERRIE</name>
              <description>Flash ECC Error Interrupt Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIE" -->
            <field>
              <name>HNGIE</name>
              <description>HANG Interrupt Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description>RDY Interrupt Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description>Flash Interrupt Status Register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIF" -->
            <field>
              <name>ERRIF</name>
              <description>Flash ECC Error Interrupt Flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNGIF" -->
            <field>
              <name>HNGIF</name>
              <description>HANG Interrupt Flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description>RDY Interrupt Flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description>Flash Interrupt Clear Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIC" -->
            <field>
              <name>ERRIC</name>
              <description>Flash ECC Error Interrupt Clear</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIC" -->
            <field>
              <name>HNGIC</name>
              <description>HANG Interrupt Clear</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIC" -->
            <field>
              <name>RDYIC</name>
              <description>RDY Interrupt Clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description>CR Trimming Data Mirror Register [BHW]</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTRMM" -->
            <field>
              <name>TTRMM</name>
              <description>CR Temperature Trimming Data Mirror</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description>CR Trimming Data Mirror</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "UNIQUE_ID" -->
    <peripheral>
      <name>UNIQUE_ID</name>
      <description>Unique ID</description>
      <version>A</version>
      <groupName>UNIQUE_ID</groupName>
      <baseAddress>0x40000200</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UIDR0" -->
        <register>
          <name>UIDR0</name>
          <description>Unique ID Register 0 [W]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description>Unique ID 27 through 0</description>
              <msb>31</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UIDR1" -->
        <register>
          <name>UIDR1</name>
          <description>Unique ID Register 1 [W]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description>Unique ID 40 through 28</description>
              <msb>12</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
