mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xr/mb9bf36xr.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "INTREQ" -->
    <peripheral>
      <name>INTREQ</name>
      <description>Interrupts</description>
      <version>A</version>
      <groupName>INTREQ</groupName>
      <baseAddress>0x40031000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x110</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "IRQ003SEL" -->
      <interrupt>
        <name>IRQ003SEL</name>
        <value>3</value>
      </interrupt>
      <!-- INTERRUPT "IRQ004SEL" -->
      <interrupt>
        <name>IRQ004SEL</name>
        <value>4</value>
      </interrupt>
      <!-- INTERRUPT "IRQ005SEL" -->
      <interrupt>
        <name>IRQ005SEL</name>
        <value>5</value>
      </interrupt>
      <!-- INTERRUPT "IRQ006SEL" -->
      <interrupt>
        <name>IRQ006SEL</name>
        <value>6</value>
      </interrupt>
      <!-- INTERRUPT "IRQ007SEL" -->
      <interrupt>
        <name>IRQ007SEL</name>
        <value>7</value>
      </interrupt>
      <!-- INTERRUPT "IRQ008SEL" -->
      <interrupt>
        <name>IRQ008SEL</name>
        <value>8</value>
      </interrupt>
      <!-- INTERRUPT "IRQ009SEL" -->
      <interrupt>
        <name>IRQ009SEL</name>
        <value>9</value>
      </interrupt>
      <!-- INTERRUPT "IRQ010SEL" -->
      <interrupt>
        <name>IRQ010SEL</name>
        <value>10</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DRQSEL" -->
        <register>
          <name>DRQSEL</name>
          <description>DMA Request Selection Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXINT3" -->
            <field>
              <name>EXINT3</name>
              <description>External pin interrupt ch.3</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT2" -->
            <field>
              <name>EXINT2</name>
              <description>External pin interrupt ch.2</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT1" -->
            <field>
              <name>EXINT1</name>
              <description>External pin interrupt ch.1</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT0" -->
            <field>
              <name>EXINT0</name>
              <description>External pin interrupt ch.0</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS7TX" -->
            <field>
              <name>MFS7TX</name>
              <description>MFS ch.7 transmission interrupt</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS7RX" -->
            <field>
              <name>MFS7RX</name>
              <description>MFS ch.7 reception interrupt</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS6TX" -->
            <field>
              <name>MFS6TX</name>
              <description>MFS ch.6 transmission interrupt</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS6RX" -->
            <field>
              <name>MFS6RX</name>
              <description>MFS ch.6 reception interrupt</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS5TX" -->
            <field>
              <name>MFS5TX</name>
              <description>MFS ch.5 transmission interrupt</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS5RX" -->
            <field>
              <name>MFS5RX</name>
              <description>MFS ch.5 reception interrupt</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS4TX" -->
            <field>
              <name>MFS4TX</name>
              <description>MFS ch.4 transmission interrupt</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS4RX" -->
            <field>
              <name>MFS4RX</name>
              <description>MFS ch.4 reception interrupt</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS3TX" -->
            <field>
              <name>MFS3TX</name>
              <description>MFS ch.3 transmission interrupt</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS3RX" -->
            <field>
              <name>MFS3RX</name>
              <description>MFS ch.3 reception interrupt</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS2TX" -->
            <field>
              <name>MFS2TX</name>
              <description>MFS ch.2 transmission interrupt</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS2RX" -->
            <field>
              <name>MFS2RX</name>
              <description>MFS ch.2 reception interrupt</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS1TX" -->
            <field>
              <name>MFS1TX</name>
              <description>MFS ch.1 transmission interrupt</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS1RX" -->
            <field>
              <name>MFS1RX</name>
              <description>MFS ch.1 reception interrupt</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS0TX" -->
            <field>
              <name>MFS0TX</name>
              <description>MFS ch.0 transmission interrupt</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS0RX" -->
            <field>
              <name>MFS0RX</name>
              <description>MFS ch.0 reception interrupt</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT6" -->
            <field>
              <name>IRQ0BT6</name>
              <description>Base timer ch.6 source 0 (IRQ0) interrupt</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT4" -->
            <field>
              <name>IRQ0BT4</name>
              <description>Base timer ch.4 source 0 (IRQ0) interrupt</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT2" -->
            <field>
              <name>IRQ0BT2</name>
              <description>Base timer ch.2 source 0 (IRQ0) interrupt</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT0" -->
            <field>
              <name>IRQ0BT0</name>
              <description>Base timer ch.6 source 0 (IRQ0) interrupt</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN2" -->
            <field>
              <name>ADCSCAN2</name>
              <description>A/D converter unit 2 scan conversion interrupt</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN1" -->
            <field>
              <name>ADCSCAN1</name>
              <description>A/D converter unit 1 scan conversion interrupt</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN0" -->
            <field>
              <name>ADCSCAN0</name>
              <description>A/D converter unit 0 scan conversion interrupt</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP5" -->
            <field>
              <name>USBEP5</name>
              <description>USB ch.0 function endpoint 5 DRQ interrupt</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP4" -->
            <field>
              <name>USBEP4</name>
              <description>USB ch.0 function endpoint 4 DRQ interrupt</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP3" -->
            <field>
              <name>USBEP3</name>
              <description>USB ch.0 function endpoint 3 DRQ interrupt</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP2" -->
            <field>
              <name>USBEP2</name>
              <description>USB ch.0 function endpoint 2 DRQ interrupt</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP1" -->
            <field>
              <name>USBEP1</name>
              <description>USB ch.0 function endpoint 1 DRQ interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ODDPKS" -->
        <register>
          <name>ODDPKS</name>
          <description>USB ch.0 Odd Packet Size DMA Enable Register [B]</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ODDPKS4" -->
            <field>
              <name>ODDPKS4</name>
              <description>The bit width of the last transfer data is converted to Byte if the transfer destination address of DMAC is USB.EP5DT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS3" -->
            <field>
              <name>ODDPKS3</name>
              <description>The bit width of the last transfer data is converted to Byte if the transfer destination address of DMAC is USB.EP4DT</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS2" -->
            <field>
              <name>ODDPKS2</name>
              <description>The bit width of the last transfer data is converted to Byte if the transfer destination address of DMAC is USB.EP3DT</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS1" -->
            <field>
              <name>ODDPKS1</name>
              <description>The bit width of the last transfer data is converted to Byte if the transfer destination address of DMAC is USB.EP2DT</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS0" -->
            <field>
              <name>ODDPKS0</name>
              <description>The bit width of the last transfer data is converted to Byte if the transfer destination address of DMAC is USB.EP1DT</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
