mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xr/mb9bf36xr.svd
        <!-- REGISTER "IRQ066MON" -->
        <register>
          <name>IRQ066MON</name>
          <description>IRQ066 Batch Read Register [BHW]</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3_RX" -->
            <field>
              <name>MFSINT3_RX</name>
              <description>Reception interrupt request of the MFS ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ067MON" -->
        <register>
          <name>IRQ067MON</name>
          <description>IRQ067 Batch Read Register [BHW]</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3_STATUS" -->
            <field>
              <name>MFSINT3_STATUS</name>
              <description>Status interrupt request of the MFS ch.3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT3_TX" -->
            <field>
              <name>MFSINT3_TX</name>
              <description>Transmission interrupt request of the MFS ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ068MON" -->
        <register>
          <name>IRQ068MON</name>
          <description>IRQ068 Batch Read Register [BHW]</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT4_RX" -->
            <field>
              <name>MFSINT4_RX</name>
              <description>Reception interrupt request of the MFS ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ069MON" -->
        <register>
          <name>IRQ069MON</name>
          <description>IRQ069 Batch Read Register [BHW]</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT4_STATUS" -->
            <field>
              <name>MFSINT4_STATUS</name>
              <description>Status interrupt request of the MFS ch.4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT4_TX" -->
            <field>
              <name>MFSINT4_TX</name>
              <description>Transmission interrupt request of the MFS ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ070MON" -->
        <register>
          <name>IRQ070MON</name>
          <description>IRQ070 Batch Read Register [BHW]</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT5_RX" -->
            <field>
              <name>MFSINT5_RX</name>
              <description>Reception interrupt request of the MFS ch.5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ071MON" -->
        <register>
          <name>IRQ071MON</name>
          <description>IRQ071 Batch Read Register [BHW]</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT5_STATUS" -->
            <field>
              <name>MFSINT5_STATUS</name>
              <description>Status interrupt request of the MFS ch.5</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT5_TX" -->
            <field>
              <name>MFSINT5_TX</name>
              <description>Transmission interrupt request of the MFS ch.5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ072MON" -->
        <register>
          <name>IRQ072MON</name>
          <description>IRQ072 Batch Read Register [BHW]</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT6_RX" -->
            <field>
              <name>MFSINT6_RX</name>
              <description>Reception interrupt request of the MFS ch.6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ073MON" -->
        <register>
          <name>IRQ073MON</name>
          <description>IRQ073 Batch Read Register [BHW]</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT6_STATUS" -->
            <field>
              <name>MFSINT6_STATUS</name>
              <description>Status interrupt request of the MFS ch.6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT6_TX" -->
            <field>
              <name>MFSINT6_TX</name>
              <description>Transmission interrupt request of the MFS ch.6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
