mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xr/mb9bf36xr.svd
        <!-- REGISTER "WTYR" -->
        <register>
          <name>WTYR</name>
          <description>Year Register [BHW]</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TY" -->
            <field>
              <name>TY</name>
              <description>2nd digit of the year information</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Y" -->
            <field>
              <name>Y</name>
              <description>1st digit of the year information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMIR" -->
        <register>
          <name>ALMIR</name>
          <description>Alarm Minute Register [BHW]</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMI" -->
            <field>
              <name>TAMI</name>
              <description>2nd digit of the alarm-set minute information</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMI" -->
            <field>
              <name>AMI</name>
              <description>1st digit of the alarm-set minute information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALHR" -->
        <register>
          <name>ALHR</name>
          <description>Alarm Hour Register [BHW]</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAH" -->
            <field>
              <name>TAH</name>
              <description>2nd digit of the alarm-set hour information</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AH" -->
            <field>
              <name>AH</name>
              <description>1st digit of the alarm-set hour information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALDR" -->
        <register>
          <name>ALDR</name>
          <description>Alarm Date Register [BHW]</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAD" -->
            <field>
              <name>TAD</name>
              <description>2nd digit of the alarm-set date information</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD" -->
            <field>
              <name>AD</name>
              <description>1st digit of the alarm-set date information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMOR" -->
        <register>
          <name>ALMOR</name>
          <description>Alarm Month Register [BHW]</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMO" -->
            <field>
              <name>TAMO</name>
              <description>2nd digit of the alarm-set month information</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMO" -->
            <field>
              <name>AMO</name>
              <description>1st digit of the alarm-set month information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALYR" -->
        <register>
          <name>ALYR</name>
          <description>Alarm Years Register [BHW]</description>
          <addressOffset>0x48</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAY" -->
            <field>
              <name>TAY</name>
              <description>2nd digit of the alarm-set year information</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AY" -->
            <field>
              <name>AY</name>
              <description>1st digit of the alarm-set year information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
